<details>
<summary>Execution result of "run-all plan" in ".//environment/dev"</summary>

```terraform
time=2024-02-20T15:58:36Z level=info msg=The stack at /github/workspace/environment/dev will be processed in the following order for command plan:
Group 1
- Module /github/workspace/environment/dev/01_Lightsail
- Module /github/workspace/environment/dev/02_Lambda
- Module /github/workspace/environment/dev/03_Sns

Group 2
- Module /github/workspace/environment/dev/04_Cloudwatch



Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-lambda.git?ref=be31ada3e1330ea3bf7d784edd559980b07eb2c2 for create_instance_snapshot_lambda...
Initializing modules...
Downloading git::https://github.com/clouddrove/terraform-aws-lightsail.git?ref=a93867cceb9995ad72e96fc57e1f3be837ed335f for lightsail...
Initializing modules...
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-sns.git?ref=718832512ecfd0af00311a181537692003ddc1bb for sns...
- lightsail in .terraform/modules/lightsail
Downloading registry.terraform.io/clouddrove/labels/aws 1.3.0 for lightsail.labels...
- create_instance_snapshot_lambda in .terraform/modules/create_instance_snapshot_lambda
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-eventbridge.git?ref=6d2d61d7ec5781563648937319d018b01d4ddfe6 for eventbridge...
- sns in .terraform/modules/sns

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.25.0, 5.33.0"...
- Installing hashicorp/aws v5.33.0...
- lightsail.labels in .terraform/modules/lightsail.labels

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.9.0, 5.33.0"...
- eventbridge in .terraform/modules/eventbridge
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-iam?ref=e63dff8de9f6aee7e9ebfbe8c676fa980f5233c0 for iam_assumable_role_custom_trust_policy...
- Installing hashicorp/aws v5.33.0...
- iam_assumable_role_custom_trust_policy in .terraform/modules/iam_assumable_role_custom_trust_policy/modules/iam-assumable-role
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-iam?ref=e63dff8de9f6aee7e9ebfbe8c676fa980f5233c0 for iam_policy...
- iam_policy in .terraform/modules/iam_policy/modules/iam-policy
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-lambda.git?ref=be31ada3e1330ea3bf7d784edd559980b07eb2c2 for prune_instance_snapshot_lambda...
- prune_instance_snapshot_lambda in .terraform/modules/prune_instance_snapshot_lambda

Initializing provider plugins...
- Finding hashicorp/null versions matching ">= 2.0.0"...
- Finding hashicorp/external versions matching ">= 1.0.0"...
- Finding hashicorp/local versions matching ">= 1.0.0"...
- Finding hashicorp/aws versions matching ">= 4.0.0, >= 4.63.0, >= 5.9.0, 5.33.0"...
- Finding latest version of hashicorp/archive...
- Installing hashicorp/archive v2.4.2...
- Installed hashicorp/archive v2.4.2 (signed by HashiCorp)
- Installing hashicorp/null v3.2.2...
- Installed hashicorp/null v3.2.2 (signed by HashiCorp)
- Installing hashicorp/external v2.3.3...
- Installed hashicorp/external v2.3.3 (signed by HashiCorp)
- Installing hashicorp/local v2.4.1...
- Installed hashicorp/local v2.4.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
module.sns.data.aws_caller_identity.current: Reading...
module.sns.data.aws_caller_identity.current: Read complete after 0s [id=074217812019]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lightsail.aws_lightsail_domain.test[0] will be created
  + resource "aws_lightsail_domain" "test" {
      + arn         = (known after apply)
      + domain_name = "clouddrove.ca"
      + id          = (known after apply)
    }

  # module.lightsail.aws_lightsail_instance.instance[0] will be created
  + resource "aws_lightsail_instance" "instance" {
      + arn                = (known after apply)
      + availability_zone  = (sensitive value)
      + blueprint_id       = (sensitive value)
      + bundle_id          = (sensitive value)
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ip_address_type    = "dualstack"
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + name               = "flick-loco-01_lightsail-0"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + tags               = {
          + "Environment" = "01_lightsail"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "flick-loco-01_lightsail-0"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-lightsail"
        }
      + tags_all           = {
          + "Environment" = "01_lightsail"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "flick-loco-01_lightsail-0"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-lightsail"
        }
      + username           = (known after apply)
    }

  # module.lightsail.aws_lightsail_instance_public_ports.public will be created
  + resource "aws_lightsail_instance_public_ports" "public" {
      + id            = (known after apply)
      + instance_name = "flick-loco-01_lightsail-0"

      + port_info {
          + cidr_list_aliases = (known after apply)
          + cidrs             = [
              + "0.0.0.0/0",
            ]
          + from_port         = 22
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 22
        }
      + port_info {
          + cidr_list_aliases = (known after apply)
          + cidrs             = [
              + "0.0.0.0/0",
            ]
          + from_port         = 80
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 80
        }
    }

  # module.lightsail.aws_lightsail_static_ip.instance[0] will be created
  + resource "aws_lightsail_static_ip" "instance" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + ip_address   = (known after apply)
      + name         = "flick-loco-01_lightsail-IP-0"
      + support_code = (known after apply)
    }

  # module.lightsail.aws_lightsail_static_ip_attachment.instance[0] will be created
  + resource "aws_lightsail_static_ip_attachment" "instance" {
      + id             = (known after apply)
      + instance_name  = (known after apply)
      + ip_address     = (known after apply)
      + static_ip_name = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.sns.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "sns:AddPermission",
              + "sns:DeleteTopic",
              + "sns:GetTopicAttributes",
              + "sns:ListSubscriptionsByTopic",
              + "sns:Publish",
              + "sns:RemovePermission",
              + "sns:SetTopicAttributes",
              + "sns:Subscribe",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "__default_statement_ID"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "074217812019",
                ]
              + variable = "AWS:SourceOwner"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.sns.aws_sns_topic.this[0] will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "LambdaLightSailSnapshotsSnsTopic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sns.aws_sns_topic_policy.this[0] will be created
  + resource "aws_sns_topic_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.sns.aws_sns_topic_subscription.this["sms"] will be created
  + resource "aws_sns_topic_subscription" "this" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "07483846019"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sms"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arn_topic = (known after apply)
data.archive_file.prune_snapshots_lambda_zip: Reading...
data.archive_file.create_snapshots_lambda_zip: Reading...
data.archive_file.create_snapshots_lambda_zip: Read complete after 0s [id=fe9e8daa3fe04b53fa5e8289d675d416cdf6e135]
data.archive_file.prune_snapshots_lambda_zip: Read complete after 0s [id=4befce66e3fbd107c7bf535705933bab7d8236db]
module.prune_instance_snapshot_lambda.data.external.archive_prepare[0]: Reading...
module.create_instance_snapshot_lambda.data.external.archive_prepare[0]: Reading...
module.create_instance_snapshot_lambda.data.aws_region.current: Reading...
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_instance_snapshot_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3959961479]
module.eventbridge.data.aws_region.current: Reading...
module.create_instance_snapshot_lambda.data.aws_caller_identity.current: Reading...
module.prune_instance_snapshot_lambda.data.aws_caller_identity.current: Reading...
module.eventbridge.data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.lambda_role: Reading...
module.iam_assumable_role_custom_trust_policy.data.aws_partition.current: Reading...
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Reading...
module.eventbridge.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.create_instance_snapshot_lambda.data.aws_partition.current: Reading...
module.create_instance_snapshot_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.eventbridge.data.aws_partition.current: Reading...
module.eventbridge.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_custom_trust_policy.data.aws_caller_identity.current: Reading...
module.iam_assumable_role_custom_trust_policy.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.lambda_role: Read complete after 0s [id=2690255455]
module.prune_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_instance_snapshot_lambda.data.aws_caller_identity.current: Read complete after 0s [id=074217812019]
module.prune_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.prune_instance_snapshot_lambda.data.aws_partition.current: Reading...
module.create_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.prune_instance_snapshot_lambda.data.aws_region.current: Reading...
module.prune_instance_snapshot_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.prune_instance_snapshot_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.create_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.prune_instance_snapshot_lambda.data.aws_caller_identity.current: Read complete after 0s [id=074217812019]
module.eventbridge.data.aws_caller_identity.current: Read complete after 0s [id=074217812019]
module.iam_assumable_role_custom_trust_policy.data.aws_caller_identity.current: Read complete after 0s [id=074217812019]
module.iam_assumable_role_custom_trust_policy.data.aws_iam_policy_document.assume_role[0]: Reading...
module.iam_assumable_role_custom_trust_policy.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=910968458]
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Read complete after 0s [id=default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.create_instance_snapshot_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.create_instance_snapshot_lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/createLightSailSnapshots"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.create_instance_snapshot_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "createLightSailSnapshots-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.create_instance_snapshot_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "createLightSailSnapshots"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.create_instance_snapshot_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "createLightSailSnapshots"
    }

  # module.eventbridge.aws_cloudwatch_event_rule.this["crons"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Trigger the createLightSailSnapshots and pruneLightSailSnapshots light to modify snapshots."
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "crons-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 day)"
      + tags                = {
          + "Name" = "crons-rule"
        }
      + tags_all            = {
          + "Name" = "crons-rule"
        }
    }

  # module.eventbridge.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "default"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "default"
        }
      + tags_all              = {
          + "Name" = "default"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_assumable_role_custom_trust_policy.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Policy to Create / Delete Lightsail Snapshots"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "LambdaModifyLightsailSnapshotsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_assumable_role_custom_trust_policy.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "LambdaModifyLightsailSnapshotsRole"
    }

  # module.iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "IAM Policy"
      + id          = (known after apply)
      + name        = "LamdbaModifyLightsailSnapshotsPolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lightsail:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "LightsailFullAccess"
                    },
                  + {
                      + Action   = "logs:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "LogsFullAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.prune_instance_snapshot_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.prune_instance_snapshot_lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pruneLightSailSnapshots"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.prune_instance_snapshot_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "pruneLightSailSnapshots-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.prune_instance_snapshot_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pruneLightSailSnapshots"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.prune_instance_snapshot_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pruneLightSailSnapshots"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arn                   = (known after apply)
  + arn_ev                = ""
  + eventbridge_rule_arns = {
      + crons = (known after apply)
    }
╷
│ Warning: Argument is deprecated
│ 
│   with module.eventbridge.aws_cloudwatch_event_rule.this["crons"],
│   on .terraform/modules/eventbridge/main.tf line 91, in resource "aws_cloudwatch_event_rule" "this":
│   91:   is_enabled          = lookup(each.value, "enabled", true)
│ 
│ Use "state" instead
╵
time=2024-02-20T15:58:54Z level=error msg=Module /github/workspace/environment/dev/02_Lambda has finished with an error: 1 error occurred:
	* [/github/workspace/environment/dev/02_Lambda/.terragrunt-cache/PnBwKwyS4VWQa_g-Zi5oYEAyEco/vxdbUoFBPPcfo8ey7QUdnvPtOeY/infrastructure/02_Lambda] exit status 1

 prefix=[/github/workspace/environment/dev/02_Lambda] 
time=2024-02-20T15:58:54Z level=error msg=Dependency /github/workspace/environment/dev/02_Lambda of module /github/workspace/environment/dev/04_Cloudwatch just finished with an error. Module /github/workspace/environment/dev/04_Cloudwatch will have to return an error too. prefix=[/github/workspace/environment/dev/04_Cloudwatch] 
time=2024-02-20T15:58:54Z level=error msg=Module /github/workspace/environment/dev/04_Cloudwatch has finished with an error: Cannot process module Module /github/workspace/environment/dev/04_Cloudwatch (excluded: false, assume applied: false, dependencies: [/github/workspace/environment/dev/02_Lambda, /github/workspace/environment/dev/03_Sns]) because one of its dependencies, Module /github/workspace/environment/dev/02_Lambda (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/github/workspace/environment/dev/02_Lambda/.terragrunt-cache/PnBwKwyS4VWQa_g-Zi5oYEAyEco/vxdbUoFBPPcfo8ey7QUdnvPtOeY/infrastructure/02_Lambda] exit status 1

 prefix=[/github/workspace/environment/dev/04_Cloudwatch] 
time=2024-02-20T15:58:54Z level=info msg=╷
│ Error: External Program Lookup Failed
│ 
│   with module.create_instance_snapshot_lambda.data.external.archive_prepare[0],
│   on .terraform/modules/create_instance_snapshot_lambda/package.tf line 10, in data "external" "archive_prepare":
│   10:   program = [local.python, "${path.module}/package.py", "prepare"]
│ 
│ The data source received an unexpected error while attempting to parse the
│ query. The data source received an unexpected error while attempting to
│ find the program.
│ 
│ The program must be accessible according to the platform where Terraform is
│ running.
│ 
│ If the expected program should be automatically found on the platform where
│ Terraform is running, ensure that the program is in an expected directory.
│ On Unix-based platforms, these directories are typically searched based on
│ the '$PATH' environment variable. On Windows-based platforms, these
│ directories are typically searched based on the '%PATH%' environment
│ variable.
│ 
│ If the expected program is relative to the Terraform configuration, it is
│ recommended that the program name includes the interpolated value of
│ 'path.module' before the program name to ensure that it is compatible with
│ varying module usage. For example: "${path.module}/my-program"
│ 
│ The program must also be executable according to the platform where
│ Terraform is running. On Unix-based platforms, the file on the filesystem
│ must have the executable bit set. On Windows-based platforms, no action is
│ typically necessary.
│ 
│ Platform: linux
│ Program: "python3"
│ Error: exec: "python3": executable file not found in $PATH
╵
╷
│ Error: External Program Lookup Failed
│ 
│   with module.prune_instance_snapshot_lambda.data.external.archive_prepare[0],
│   on .terraform/modules/prune_instance_snapshot_lambda/package.tf line 10, in data "external" "archive_prepare":
│   10:   program = [local.python, "${path.module}/package.py", "prepare"]
│ 
│ The data source received an unexpected error while attempting to parse the
│ query. The data source received an unexpected error while attempting to
│ find the program.
│ 
│ The program must be accessible according to the platform where Terraform is
│ running.
│ 
│ If the expected program should be automatically found on the platform where
│ Terraform is running, ensure that the program is in an expected directory.
│ On Unix-based platforms, these directories are typically searched based on
│ the '$PATH' environment variable. On Windows-based platforms, these
│ directories are typically searched based on the '%PATH%' environment
│ variable.
│ 
│ If the expected program is relative to the Terraform configuration, it is
│ recommended that the program name includes the interpolated value of
│ 'path.module' before the program name to ensure that it is compatible with
│ varying module usage. For example: "${path.module}/my-program"
│ 
│ The program must also be executable according to the platform where
│ Terraform is running. On Unix-based platforms, the file on the filesystem
│ must have the executable bit set. On Windows-based platforms, no action is
│ typically necessary.
│ 
│ Platform: linux
│ Program: "python3"
│ Error: exec: "python3": executable file not found in $PATH
╵
time=2024-02-20T15:58:54Z level=error msg=terraform invocation failed in /github/workspace/environment/dev/02_Lambda/.terragrunt-cache/PnBwKwyS4VWQa_g-Zi5oYEAyEco/vxdbUoFBPPcfo8ey7QUdnvPtOeY/infrastructure/02_Lambda prefix=[/github/workspace/environment/dev/02_Lambda] 

time=2024-02-20T15:58:54Z level=error msg=2 errors occurred:
	* [/github/workspace/environment/dev/02_Lambda/.terragrunt-cache/PnBwKwyS4VWQa_g-Zi5oYEAyEco/vxdbUoFBPPcfo8ey7QUdnvPtOeY/infrastructure/02_Lambda] exit status 1
	* Cannot process module Module /github/workspace/environment/dev/04_Cloudwatch (excluded: false, assume applied: false, dependencies: [/github/workspace/environment/dev/02_Lambda, /github/workspace/environment/dev/03_Sns]) because one of its dependencies, Module /github/workspace/environment/dev/02_Lambda (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/github/workspace/environment/dev/02_Lambda/.terragrunt-cache/PnBwKwyS4VWQa_g-Zi5oYEAyEco/vxdbUoFBPPcfo8ey7QUdnvPtOeY/infrastructure/02_Lambda] exit status 1
```

</details>
    